palp/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_hid_kbd.c
bool udi_hid_lamparray_setup(void) { return udi_hid_setup(&udi_hid_lamparray_rate, &udi_hid_lamparray_protocol, (uint8_t *)&udi_hid_lamparray_report_desc, udi_hid_lamparray_setreport); }

uint8_t udi_hid_lamparray_getsetting(void) { return 0; }

static bool udi_hid_lamparray_setreport(void) {
    if (Udd_setup_is_out()) {
        switch (udd_g_ctrlreq.req.wValue >> 8) {
            case USB_HID_REPORT_TYPE_FEATURE:
                if (HID_LAMPARRAY_REPORT_SIZE == udd_g_ctrlreq.req.wLength) {
                    udd_g_ctrlreq.payload = udi_hid_lamparray_report_set;
                    udd_g_ctrlreq.callback = udi_hid_lamparray_setreport_valid;
                    udd_g_ctrlreq.payload_size = HID_LAMPARRAY_REPORT_SIZE;
                    return true;
                }
        }
    }
    return false;
}

bool udi_hid_lamparray_send_report(void) {
    if (!main_b_lamparray_enable) {
        return false;
    }

    if (udi_hid_lamparray_b_report_trans_ongoing) {
        return false;
    }

    memcpy(udi_hid_lamparray_report_trans, udi_hid_lamparray_report, HID_LAMPARRAY_REPORT_SIZE);
    udi_hid_lamparray_b_report_valid         = false;
    udi_hid_lamparray_b_report_trans_ongoing = udd_ep_run(UDI_HID_LAMPARRAY_EP_IN | USB_EP_DIR_IN, false, udi_hid_lamparray_report_trans, HID_LAMPARRAY_REPORT_SIZE, udi_hid_lamparray_report_sent);

    return udi_hid_lamparray_b_report_trans_ongoing;
}

static void udi_hid_lamparray_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep) {
    UNUSED(status);
    UNUSED(nb_sent);
    UNUSED(ep);
    udi_hid_lamparray_b_report_trans_ongoing = false;
    if (udi_hid_lamparray_b_report_valid) {
        udi_hid_lamparray_send_report();
    }
}

static void udi_hid_lamparray_setreport_valid(void) {
    UDI_HID_LAMPARRAY_RECEIVE(udi_hid_lamparray_report_set, HID_LAMPARRAY_REPORT_SIZE);
}

/*
void raw_hid_send(uint8_t *data, uint8_t length) {
    if (main_b_lamparray_enable && !udi_hid_lamparray_b_report_trans_ongoing && length == HID_LAMPARRAY_REPORT_SIZE) {
        memcpy(udi_hid_lamparray_report, data, HID_LAMPARRAY_REPORT_SIZE);
        udi_hid_lamparray_send_report();
    }
}
*/

bool udi_hid_lamparray_receive_report(void) {
    if (!main_b_lamparray_enable) {
        return false;
    }

    return udd_ep_run(UDI_HID_LAMPARRAY_EP_OUT | USB_EP_DIR_OUT, false, udi_hid_lamparray_report_recv, HID_LAMPARRAY_REPORT_SIZE, udi_hid_lamparray_report_rcvd);
}

static void udi_hid_lamparray_report_rcvd(udd_ep_status_t status, iram_size_t nb_rcvd, udd_ep_id_t ep) {
    UNUSED(ep);

    if (status == UDD_EP_TRANSFER_OK) {
        UDI_HID_LAMPARRAY_RECEIVE(udi_hid_lamparray_report_recv, nb_rcvd);
    }
}

#endif // HID_LAMPARRAY_ENABLE
